<?php
define('JINRO_ROOT', '../..');
require_once(JINRO_ROOT . '/include/init.php');
$INIT_CONF->LoadFile('info_functions');
OutputInfoPageHeader('開発履歴 / 1.5', 1, 'develop_history');
?>
<p><a href="history.php">最新情報</a></p>
<p>
Ver. 1.5.x<br>
<a href="#ver151">1</a>
<a href="#ver152">2</a>
</p>
<p>
Ver. 1.5.0<br>
<a href="#ver150">Release</a>
</p>
<p>
<a href="#ver150b1">β1</a>
<a href="#ver150b2">β2</a>
<a href="#ver150b3">β3</a>
<a href="#ver150b4">β4</a>
<a href="#ver150b5">β5</a>
<a href="#ver150b6">β6</a>
<a href="#ver150b7">β7</a>
<a href="#ver150b8">β8</a>
<a href="#ver150b9">β9</a>
<a href="#ver150b10">β10</a>
<a href="#ver150b11">β11</a>
<a href="#ver150b12">β12</a>
<a href="#ver150b13">β13</a>
<a href="#ver150b14">β14</a>
<a href="#ver150b15">β15</a>
<a href="#ver150b16">β16</a>
<a href="#ver150b17">β17</a>
</p>
<p>
<a href="#ver150a1">α1</a>
<a href="#ver150a2">α2</a>
<a href="#ver150a3">α3</a>
<a href="#ver150a4">α4</a>
<a href="#ver150a5">α5</a>
<a href="#ver150a6">α6</a>
<a href="#ver150a7">α7</a>
<a href="#ver150a8">α8</a>
<a href="#ver150a9">α9</a>
</p>

<h2 id="ver152">Ver. 1.5.2 (Rev. 516) : 2012/02/26 (Sun) 00:00</h2>
<ul>
<li>「因幡兎」実装</li>
</ul>

<h2 id="ver151">Ver. 1.5.1 (Rev. 459) : 2012/01/09 (Mon) 23:28</h2>
<ul>
<li>発言量制限機能を実装</li>
</ul>

<h2 id="ver150">Ver. 1.5.0 (Rev. 442) : 2011/12/24 (Sat) 00:00</h2>
<ul>
<li>超過警告音を実装</li>
</ul>

<h2 id="ver150b17">Ver. 1.5.0 β17 (Rev. 436) : 2011/11/26 (Sat) 17:43</h2>
<ul>
<li>「帝狼」実装</li>
<li>「キューピッド置換村」「女神村」「小悪魔村」「天使村」オプション実装</li>
</ul>

<h2 id="ver150b16">Ver. 1.5.0 β16 (Rev. 426) : 2011/11/13 (Sun) 03:34</h2>
<ul>
<li>「蛻庵」「寿羊狐」「豊穣神」「紅葉神」「幻視者」実装</li>
</ul>

<h2 id="ver150b15">Ver. 1.5.0 β15 (Rev. 415) : 2011/10/30 (Sun) 00:24</h2>
<ul>
<li>「雷公」「物真似師」実装</li>
</ul>

<h2 id="ver150b14">Ver. 1.5.0 β14 (Rev. 411) : 2011/10/23 (Sun) 21:12</h2>
<ul>
<li>「人狼追加」オプション実装</li>
<li>「鋭狼」「聖徳道士」「葛の葉」実装</li>
<li>サブ役職「魔が言」実装</li>
<li>スキン画像追加</li>
</ul>

<h2 id="ver150b13">Ver. 1.5.0 β13 (Rev. 404) : 2011/10/15 (Sat) 20:57</h2>
<ul>
<li>「山彦」「白蔵主」「僵尸」「尸解仙」「邪仙」実装</li>
</ul>

<h2 id="ver150b12">Ver. 1.5.0 β12 (Rev. 386) : 2011/09/25 (Sun) 22:32</h2>
<ul>
<li>「妖狐追加」「子狐登場」「天啓封印」オプション実装</li>
<li>「青行灯」「五徳猫」実装</li>
<li>出現率変動モード：F(合戦村)追加</li>
</ul>

<h2 id="ver150b11">Ver. 1.5.0 β11 (Rev. 379) : 2011/08/25 (Thu) 23:28</h2>
<ul>
<li>「デスノート村」オプション実装</li>
<li>「おしら様」「常世神」実装</li>
<li>サブ役職「オシラ遊び」「デスノート」実装</li>
</ul>

<h2 id="ver150b10">Ver. 1.5.0 β10 (Rev. 375) : 2011/08/20 (Sat) 02:49</h2>
<ul>
<li>「狂人村」「出題者村」「吸血鬼村」「鵺村」「殉教者村」「共有者置換村」オプション実装</li>
<li>「隠者」「鬼子母神」「暴君」「静狼」「賢者」実装</li>
</ul>

<h2 id="ver150b9">Ver. 1.5.0 β9 (Rev. 372) : 2011/08/11 (Thu) 02:09</h2>
<ul>
<li>「指導者」「狙毒者」「萌占い師」「蝕巫女」「阿修羅」「夜行鬼」「蛇姫」「人魚」実装</li>
<li>サブ役職制限：HARDモード追加</li>
<li>出現率変動モード：D(封蘇村)・E(封憑村)追加</li>
</ul>

<h2 id="ver150b8">Ver. 1.5.0 β8 (Rev. 368) : 2011/07/31 (Sun) 06:43</h2>
<ul>
<li>「傀儡師」「老兵」「寒戸婆」「堕天使」実装</li>
<li>固定配役追加モード：L(白銀村)追加</li>
<li>出現率変動モード：C(派生村)追加</li>
</ul>

<h2 id="ver150b7">Ver. 1.5.0 β7 (Rev. 365) : 2011/07/23 (Sat) 05:03</h2>
<ul>
<li>「出現率変動モード」オプション実装</li>
<li>「火狼」「宙狐」「霧狼」「霧狐」実装</li>
<li>サブ役職「鬼火」「天火」「狐火」「古戦場火」「松明丸」実装</li>
</ul>

<h2 id="ver150b6">Ver. 1.5.0 β6 (Rev. 363) : 2011/07/09 (Sat) 05:23</h2>
<ul>
<li>「狂人置換村」「狂信者村」「囁き狂人村」オプション実装</li>
<li>「家神」「屍鬼」「草履大将」「未亡人」「無鉄砲者」「ひんな神」「恋妖精」実装</li>
<li>サブ役職「ひんな持ち」「悲恋」実装</li>
</ul>

<h2 id="ver150b5">Ver. 1.5.0 β5 (Rev. 357) : 2011/06/27 (Mon) 20:18</h2>
<ul>
<li>「裏・闇鍋モード」オプション実装</li>
</ul>

<h2 id="ver150b4">Ver. 1.5.0 β4 (Rev. 355) : 2011/06/25 (Sat) 05:46</h2>
<ul>
<li>「求道者」「山わろ」「がしゃどくろ」「狂骨」「麒麟」「身代わり地蔵」<br>「夜刀神」「羊飼い」「剣闘士」実装</li>
<li>サブ役職「元求道者」「一日村長」「羊」「羊皮」実装</li>
</ul>

<h2 id="ver150b3">Ver. 1.5.0 β3 (Rev. 348) : 2011/06/18 (Sat) 00:11</h2>
<ul>
<li>「黒幕」「復讐者」「後援者」実装</li>
<li>サブ役職「無精者」「わらしべ長者」「没落者」「燕返し」「脱落者」「仇敵」「受援者」実装</li>
</ul>

<h2 id="ver150b2">Ver. 1.5.0 β2 (Rev. 339) : 2011/05/27 (Fri) 18:42</h2>
<ul>
<li>「人馬」「首領」実装</li>
<li>固定追加配役モード：K(覚醒村)追加</li>
</ul>

<h2 id="ver150b1">Ver. 1.5.0 β1 (Rev. 333) : 2011/05/13 (Fri) 02:49</h2>
<ul>
<li>「大妖精」「吟遊詩人」「紅天使」「決闘者」「戦乙女」「舞首」実装</li>
<li>サブ役職「宿敵」実装</li>
<li>固定追加配役モード：I(恋人村)・J(宿敵村)追加</li>
</ul>

<h2 id="ver150a9">Ver. 1.5.0 α9 (Rev. 324) : 2011/05/02 (Mon) 02:19</h2>
<ul>
<li>「水妖姫」「半鳥女」「殉教者」「野狐禅」実装</li>
<li>サブ役職「能力発現」実装</li>
<li>天候「雪明り」「蛍火」「日蝕」「月蝕」「宵闇」「白夜」「極光」実装</li>
</ul>

<h2 id="ver150a8">Ver. 1.5.0 α8 (Rev. 317) : 2011/04/23 (Sat) 05:09</h2>
<ul>
<li>「左道使い」「道化師」「狡狐」「狡狼」実装</li>
<li>天候「濃霧」「台風」「萌動」「蜃気楼」「紅月」「砂塵嵐」「霧雨」「木枯らし」実装</li>
<li>天候確率変動システム実装</li>
</ul>

<h2 id="ver150a7">Ver. 1.5.0 α7 (Rev. 313) : 2011/04/09 (Sat) 02:54</h2>
<ul>
<li>「夜叉丸」「滝夜叉姫」「迷い人」「門番」「萌蝙蝠」実装</li>
<li>固定追加配役モード：G(嘘吐村)・H(村人村)追加</li>
</ul>

<h2 id="ver150a6">Ver. 1.5.0 α6 (Rev. 309) : 2011/03/27 (Sun) 03:54</h2>
<ul>
<li>「仙狼」「結界師」「精神感応者」「交霊術師」実装</li>
<li>憑依中の憑依能力者が処刑された時に憑依先の能力が発動することがあるバグを修正</li>
</ul>

<h2 id="ver150a5">Ver. 1.5.0 α5 (Rev. 297) : 2011/03/10 (Thu) 21:37</h2>
<ul>
<li>「舟幽霊」「黒衣」「釣瓶落とし」「八咫烏」実装</li>
<li>サブ役職「入道」実装</li>
</ul>

<h2 id="ver150a4">Ver. 1.5.0 α4 (Rev. 291) : 2011/02/18 (Fri) 05:06</h2>
<ul>
<li>「比丘尼」「祈祷師」実装</li>
<li>天候「波風」「小夜嵐」「流星群」「春時雨」「木漏れ日」「疎雨」「川霧」「蒼天」<br>
「雪」「梅雨」「雹」「半月」「曇天」「箒星」「旱魃」実装
</li>
</ul>

<h2 id="ver150a3">Ver. 1.5.0 α3 (Rev. 284) : 2011/02/04 (Fri) 04:03</h2>
<ul>
<li>「死化粧師」「密偵」実装</li>
<li>天候「黄砂」「虹」「ダイヤモンドダスト」「バナナの皮」「スポットライト」「タライ」<br>
  「凪」「青天の霹靂」「涙雨」「熱帯夜」「朧月」「叢雲」「雷雨」「快晴」「慈雨」実装
</li>
</ul>

<h2 id="ver150a2">Ver. 1.5.0 α2 (Rev. 273) : 2011/01/21 (Fri) 07:38</h2>
<ul>
<li>ゲームオプション「天候あり」実装</li>
</ul>

<h2 id="ver150a1">Ver. 1.5.0 α1 (Rev. 269) : 2011/01/15 (Sat) 09:16</h2>
<ul>
<li>「魔法使い」「八卦見」実装</li>
</ul>
</body></html>
