<?php
define('JINRO_ROOT', '../..');
require_once(JINRO_ROOT . '/include/init.php');
$INIT_CONF->LoadFile('info_functions');
OutputInfoPageHeader('開発履歴 / 1.4', 1, 'develop_history');
?>
<p><a href="history.php">最新情報</a></p>
<p>
Ver. 1.4.x<br>
<a href="#ver141">1</a>
<a href="#ver142">2</a>
<a href="#ver143">3</a>
<a href="#ver144">4</a>
<a href="#ver145">5</a>
<a href="#ver146">6</a>
<a href="#ver147">7</a>
<a href="#ver148">8</a>
<a href="#ver149">9</a>
<a href="#ver1410">10</a>
<a href="#ver1411">11</a>
<a href="#ver1412">12</a>
<a href="#ver1413">13</a>
<a href="#ver1414">14</a>
<a href="#ver1415">15</a>
</p>
<p>
Ver. 1.4.0<br>
<a href="#ver140rc1">RC1</a>
<a href="#ver140rc2">RC2</a>
<a href="#ver140">Release</a>
</p>
<p>
<a href="#ver140b1">β1</a>
<a href="#ver140b2">β2</a>
<a href="#ver140b3">β3</a>
<a href="#ver140b4">β4</a>
<a href="#ver140b5">β5</a>
<a href="#ver140b6">β6</a>
<a href="#ver140b7">β7</a>
<a href="#ver140b8">β8</a>
<a href="#ver140b9">β9</a>
<a href="#ver140b10">β10</a>
<a href="#ver140b11">β11</a>
<a href="#ver140b12">β12</a>
<a href="#ver140b13">β13</a>
<a href="#ver140b14">β14</a>
<a href="#ver140b15">β15</a>
<a href="#ver140b16">β16</a>
<a href="#ver140b17">β17</a>
<a href="#ver140b18">β18</a>
<a href="#ver140b19">β19</a>
<a href="#ver140b20">β20</a>
<a href="#ver140b21">β21</a>
<a href="#ver140b22">β22</a>
</p>
<p>
<a href="#ver140a1">α1</a>
<a href="#ver140a2">α2</a>
<a href="#ver140a3">α3-6</a>
<a href="#ver140a7">α7</a>
<a href="#ver140a8">α8</a>
<a href="#ver140a9">α9</a>
<a href="#ver140a10">α10</a>
<a href="#ver140a11">α11</a>
<a href="#ver140a12">α12</a>
<a href="#ver140a13">α13</a>
<a href="#ver140a14">α14</a>
<a href="#ver140a15">α15</a>
<a href="#ver140a16">α16</a>
<a href="#ver140a17">α17</a>
<a href="#ver140a18">α18</a>
<a href="#ver140a19">α19</a>
<a href="#ver140a20">α20</a>
<a href="#ver140a21">α21</a>
<a href="#ver140a22">α22</a>
<a href="#ver140a23">α23</a>
<a href="#ver140a24">α24</a>
</p>

<h2 id="ver1415">Ver. 1.4.15 (Rev. 460) : 2012/01/10 (Tue) 00:27</h2>
<ul>
<li>発言量制限機能を実装</li>
</ul>

<h2 id="ver1414">Ver. 1.4.14 (Rev. 441) : 2011/12/23 (Fri) 18:09</h2>
<ul>
<li>超過警告音を実装</li>
</ul>

<h2 id="ver1413">Ver. 1.4.13 (Rev. 439) : 2011/12/04 (Sun) 01:41</h2>
<ul>
<li>初期セットアップのバグ修正</li>
</ul>

<h2 id="ver1412">Ver. 1.4.12 (Rev. 412) : 2011/10/25 (Tue) 21:25</h2>
<ul>
<li>スキン画像を追加</li>
</ul>

<h2 id="ver1411">Ver. 1.4.11 (Rev. 397) : 2011/10/08 (Sat) 12:07</h2>
<ul>
<li>ログにゲームオプションを表示</li>
</ul>

<h2 id="ver1410">Ver. 1.4.10 (Rev. 383) : 2011/09/17 (Sat) 23:50</h2>
<ul>
<li>アイコン非表示機能の実装</li>
</ul>

<h2 id="ver149">Ver. 1.4.9 (Rev. 376) : 2011/08/20 (Sat) 23:25</h2>
<ul>
<li>遺言消去機能の実装</li>
</ul>

<h2 id="ver148">Ver. 1.4.8 (Rev. 360) : 2011/07/04 (Mon) 18:53</h2>
<ul>
<li>引き分け・廃村の CSS 変更</li>
</ul>

<h2 id="ver147">Ver. 1.4.7 (Rev. 305) : 2011/03/20 (Sun) 11:47</h2>
<ul>
<li>夜の投票結果の表示を変更</li>
</ul>

<h2 id="ver146">Ver. 1.4.6 (Rev. 292) : 2011/02/22 (Tue) 01:50</h2>
<ul>
<li>PHPの乱数処理のバージョン依存に対応</li>
</ul>

<h2 id="ver145">Ver. 1.4.5 (Rev. 290) : 2011/02/15 (Tue) 05:27</h2>
<ul>
<li>入村時の音声機能を向上</li>
</ul>

<h2 id="ver144">Ver. 1.4.4 (Rev. 286) : 2011/02/05 (Sat) 00:41</h2>
<ul>
<li>PHP の浮動小数点数に関するバグを追加修正</li>
</ul>

<h2 id="ver143">Ver. 1.4.3 (Rev. 281) : 2011/01/28 (Fri) 03:12</h2>
<ul>
<li>アイコンのキーワード検索機能を実装</li>
</ul>

<h2 id="ver142">Ver. 1.4.2 (Rev. 277) : 2011/01/25 (Tue) 02:12</h2>
<ul>
<li>PHP の浮動小数点数に関するバグを追加修正</li>
<li>村作成用パスワード機能を実装</li>
</ul>

<h2 id="ver141">Ver. 1.4.1 (Rev. 265) : 2011/01/09 (Sun) 00:57</h2>
<ul>
<li>PHP の浮動小数点数に関するバグに対応</li>
</ul>

<h2 id="ver140">Ver. 1.4.0 (Rev. 246) : 2010/12/24 (Fri) 03:23</h2>
<ul>
<li>バージョン情報表記の改訂</li>
</ul>

<h2 id="ver140rc2">Ver. 1.4.0 RC2 (Rev. 242) : 2010/12/17 (Fri) 02:42</h2>
<ul>
<li>「異議」あり音源の差し替え</li>
<li>出題者に決定能力を追加</li>
</ul>

<h2 id="ver140rc1">Ver. 1.4.0 RC1 (Rev. 234) : 2010/12/11 (Sat) 04:14</h2>
<ul>
<li>固定追加配役モード：ランダム枠の実装、F(鬼村)追加</li>
</ul>

<h2 id="ver140b22">Ver. 1.4.0 β22 (Rev. 231) : 2010/12/05 (Sun) 00:17</h2>
<ul>
<li>「猩々」「弁財天」「錬金術師」「一角獣」「侍」「茨木童子」「執筆者」実装</li>
<li>サブ役職「恋耳鳴」実装</li>
</ul>

<h2 id="ver140b21">Ver. 1.4.0 β21 (Rev. 224) : 2010/11/23 (Tue) 14:14</h2>
<ul>
<li>「毘沙門天」「星熊童子」「大司祭」「神主」「和蘭人形」「露西亜人形」「紅蝙蝠」実装</li>
<li>サブ役職「ジョーカー」実装</li>
<li>「ババ抜き村」オプション実装</li>
</ul>

<h2 id="ver140b20">Ver. 1.4.0 β20 (Rev. 221) : 2010/11/12 (Fri) 03:21</h2>
<ul>
<li>「蟲姫」「酒呑童子」「祟神」「蛇神」「倫敦人形」「西蔵人形」「影妖精」実装</li>
<li>サブ役職「洗脳者」実装</li>
</ul>

<h2 id="ver140b19">Ver. 1.4.0 β19 (Rev. 217) : 2010/10/31 (Sun) 01:22</h2>
<ul>
<li>「固定追加配役モード」オプション実装</li>
<li>「縁切地蔵」「榊鬼」「冥血鬼」「吸血姫」「傘化け」<br>
  「金鬼」「風鬼」「水鬼」「隠行鬼」「夜叉」「般若」「荼枳尼天」実装</li>
</ul>

<h2 id="ver140b18">Ver. 1.4.0 β18 (Rev. 213) : 2010/10/12 (Tue) 04:48</h2>
<ul>
<li>「静寂村」「白夜村」「宵闇村」オプション実装</li>
<li>「守護天使」「影武者」「件」「鬼」「前鬼」「後鬼」「青髭公」「飛縁魔」実装</li>
</ul>

<h2 id="ver140b17">Ver. 1.4.0 β17 (Rev. 210) : 2010/10/03 (Sun) 06:40</h2>
<ul>
<li>「グレラン村」「早朝待機制」オプション実装</li>
<li>「狢」「化狐」「恋司祭」「蝕仙狸」「吸血公」実装</li>
<li>サブ役職「恋色迷彩」実装</li>
</ul>

<h2 id="ver140b16">Ver. 1.4.0 β16 (Rev. 204) : 2010/08/22 (Sun) 04:20</h2>
<ul>
<li>文字コードのベースを UTF-8 に変更</li>
<li>「白澤」「雪女」「氷妖精」実装</li>
</ul>

<h2 id="ver140b15">Ver. 1.4.0 β15 (Rev. 201) : 2010/08/12 (Thu) 04:48</h2>
<ul>
<li>「急所村」オプション実装</li>
<li>「冥狼」「冥狐」「座敷童子」「探知師」「夢司祭」「仙人」「獣人」実装</li>
</ul>

<h2 id="ver140b14">Ver. 1.4.0 β14 (Rev. 196) : 2010/07/29 (Thu) 04:47</h2>
<ul>
<li>「村人置換村」「蝙蝠村」「キューピッド村」「サブ役職制限」オプション実装</li>
<li>「夜雀」「吸血鬼」実装</li>
<li>サブ役職「会心」「囁耳鳴」「爆睡者」「役者」「男性恐怖症」他、実装</li>
</ul>

<h2 id="ver140b13">Ver. 1.4.0 β13 (Rev. 194) : 2010/07/17 (Sat) 18:40</h2>
<ul>
<li>未投票突然死も死亡欄に表示する仕様に変更</li>
<li>神話マニア系の所属を神話マニア陣営に移動</li>
<li>巫女の所属を巫女系に移動</li>
<li>「月狐」「日妖精」「猟師」「辻斬り」「封印師」他、実装</li>
</ul>

<h2 id="ver140b12">Ver. 1.4.0 β12 (Rev. 191) : 2010/07/11 (Sun) 07:04</h2>
<ul>
<li>「超・闇鍋モード」「ゲルト君モード」「オープニングあり」オプション実装</li>
<li>「餓狼」「占星術師」「境界師」「花妖精」実装</li>
</ul>

<h2 id="ver140b11">Ver. 1.4.0 β11 (Rev. 187) : 2010/07/06 (Tue) 02:55</h2>
<ul>
<li>「魂移使」「覚醒者」「幻狼」「逃亡者」「囁騒霊」「かぐや姫」他、実装</li>
</ul>

<h2 id="ver140b10">Ver. 1.4.0 β10 (Rev. 184) : 2010/06/12 (Sat) 19:00</h2>
<ul>
  <li>探偵村実装</li>
  <li>「人形遣い」「上海人形」「探偵」「死神」「司教」他、実装</li>
</ul>

<h2 id="ver140b9">Ver. 1.4.0 β9 (Rev. 183) : 2010/05/29 (Sat) 04:04</h2>
<ul>
<li>Twitter 投稿機能の実装</li>
<li>BBS 表示機能の実装</li>
<li>決闘村の配役変更システムの実装</li>
<li>「反魂師」「河童」「天狼」「土蜘蛛」「犬神」「大蝙蝠」「奇術師」他、実装</li>
<li>サブ役職「自信家」実装</li>
<li>「夢守人」「夢毒者」「獏」「天狐」「妖精系」の仕様変更</li>
</ul>

<h2 id="ver140b8">Ver. 1.4.0 β8 (Rev. 178) : 2010/03/28 (Sun) 01:48</h2>
<ul>
<li>トリップ機能の調整</li>
<li>入村画面の調整</li>
<li>「翠狼」「蒼狼」「金狼」「雛狼」「天使」「小悪魔」他、実装</li>
</ul>

<h2 id="ver140b7">Ver. 1.4.0 β7 (Rev. 176) : 2010/03/20 (Sat) 19:35</h2>
<ul>
<li>萌系の変換発動を昼限定に変更</li>
<li>巫女の恋人後追い判定が正しく出ない事があるバグ修正<br>
  (β6の鵺対応によるエンバグ、誤判定をした場合は「恋人」になる)
</li>
<li>サトラレ系の仕様を調整</li>
<li>「聖女」「扇動者」「光妖精」「闇妖精」「鏡妖精」実装</li>
<li>蘇生辞退システム実装</li>
</ul>

<h2 id="ver140b6">Ver. 1.4.0 β6 (Rev. 174) : 2010/03/12 (Fri) 22:25</h2>
<ul>
<li>鵺の所属陣営が正しく出ないバグ修正 (修正前は常時村人判定)</li>
<li>「妖精系」「策士」「亡霊嬢」「毒橋姫」「連毒者」実装</li>
<li>アイコン情報の編集機能を実装</li>
</ul>

<h2 id="ver140b5">Ver. 1.4.0 β5 (Rev. 171) : 2010/03/04 (Thu) 07:52</h2>
<ul>
<li>「長老」「古狼」「古狐」「古蝙蝠」「忍者」実装</li>
<li>情報一覧ページの追加</li>
<li>ユーザアイコン表示の機能強化</li>
</ul>

<h2 id="ver140b4">Ver. 1.4.0 β4 (Rev. 168) : 2010/02/24 (Wed) 03:15</h2>
<ul>
<li>リアルタイム表示 JavaScript の自動補正処理 (時計合わせが不要になります)</li>
<li>情報一覧ページの再編成</li>
<li>「暗殺者」「憑狼」登場オプション実装</li>
<li>「巫女」登場オプションの仕様変更 (狂信者 → 女神)</li>
<li>ユーザアイコン表示/登録の機能強化</li>
<li>ユーザ入村画面の改訂</li>
</ul>

<h2 id="ver140b3">Ver. 1.4.0 β3 (Rev. 164) : 2010/02/16 (Tue) 03:14</h2>
<ul>
<li>「自動霊界オフ」 オプション実装</li>
<li>ユーザアイコンテーブルにカラムを追加 (入力インターフェイスは未実装)</li>
</ul>

<h2 id="ver140b2">Ver. 1.4.0 β2 (Rev. 157) : 2010/02/08 (Mon) 03:12</h2>
<ul>
<li>「預言者」「天人」「イタコ」「仙狸」「仙狐」実装</li>
<li>再入村リンクの表示機能実装 (過去ログ)</li>
</ul>

<h2 id="ver140b1">Ver. 1.4.0 β1 (Rev. 152) : 2010/02/02 (Tue) 03:36</h2>
<ul>
<li>設定ファイルの配置を変更</li>
</ul>

<h2 id="ver140a24">Ver. 1.4.0 α24 (Rev. 149) : 2010/01/28 (Thu) 21:15</h2>
<ul>
<li>「司祭」「賢狼」「憑狼」「黒狐」「夢求愛者」他、実装</li>
<li>初期化処理を再構築</li>
</ul>

<h2 id="ver140a23">Ver. 1.4.0 α23 (Rev. 140) : 2010/01/10 (Sun) 05:39</h2>
<ul>
<li>「鵺」「女神」実装</li>
<li>サブ役職「内弁慶」「草刈」「草原迷彩」他、実装</li>
<li>突然死がらみのバグ修正</li>
</ul>

<h2 id="ver140a22">Ver. 1.4.0 α22 (Rev. 139) : 2010/01/03 (Sun) 07:50</h2>
<ul>
<li>「橋姫」実装</li>
<li>サブ役職「公開者」「独身貴族」実装</li>
<li>さとり系のバグ修正</li>
</ul>

<h2 id="ver140a21">Ver. 1.4.0 α21 (Rev. 138) : 2009/12/27 (Sun) 19:55</h2>
<ul>
<li>「蝙蝠」系「銀狼」「さとり」「火車」「獏」実装</li>
<li>初期化ルーチンを再構築</li>
</ul>

<h2 id="ver140a20">Ver. 1.4.0 α20 (Rev. 127) : 2009/09/23 (Wed) 05:16</h2>
<ul>
<li>「呪術師」「九尾」「厄神」「陰陽師」「閻魔」「銀狐」実装</li>
<li>システムメッセージ周りの改訂</li>
</ul>

<h2 id="ver140a19">Ver. 1.4.0 α19 (Rev. 123) : 2009/08/26 (Wed) 00:31</h2>
<ul>
<li>「邪魔狂人」「ひよこ鑑定士」実装</li>
<li>サブ役職「七曜迷彩」実装</li>
<li>「決闘村」「天邪鬼村」オプション実装</li>
<li>身代わり君キューピッド対応</li>
</ul>

<h2 id="ver140a18">Ver. 1.4.0 α18 (Rev. 117) : 2009/08/13 (Thu) 22:27</h2>
<ul>
<li>「猫又」「暗殺者」「精神鑑定士」「罠師」実装</li>
<li>夢系の仕様変更</li>
</ul>

<h2 id="ver140a17">Ver. 1.4.0 α17 (Rev. 105) : 2009/08/02 (Sun) 17:12</h2>
<ul>
<li>「夢枕人」「雲外鏡」「強毒者」「呪狼」「囁き狂人」「天狐」他、実装</li>
<li>サブ役職「スピーカー」「メガホン」「マスク」「虹色迷彩」「解答者」実装</li>
<li>クイズ村の調整</li>
</ul>

<h2 id="ver140a16">Ver. 1.4.0 α16 (Rev. 97) : 2009/07/23 (Thu) 12:25</h2>
<ul>
<li>過去ログの表示を調整</li>
</ul>

<h2 id="ver140a15">Ver. 1.4.0 α15 (Rev. 93) : 2009/07/20 (Mon) 12:14</h2>
<ul>
<li>サブ役職「波乱万丈」「ゴマすり」「短気」実装</li>
<li>ゲームオプションの画像追加</li>
</ul>

<h2 id="ver140a14">Ver. 1.4.0 α14 (Rev. 92) : 2009/07/18 (Sat) 20:42</h2>
<ul>
<li>「ブン屋」「夢見人」「萌狼」実装</li>
<li>サブ役職「臆病者」「耳栓」「幸運」「雑草魂」「紳士」他、実装</li>
</ul>

<h2 id="ver140a13">Ver. 1.4.0 α13 (Rev. 82) : 2009/07/10 (Fri) 03:15</h2>
<ul>
<li>「舌禍狼」「無意識」実装</li>
</ul>

<h2 id="ver140a12">Ver. 1.4.0 α12 (Rev. 77) : 2009/07/08 (Wed) 03:34</h2>
<ul>
<li>「薬師」「毒狼」実装</li>
</ul>

<h2 id="ver140a11">Ver. 1.4.0 α11 (Rev. 65) : 2009/07/05 (Sun) 19:34</h2>
<ul>
<li>「神話マニア」実装</li>
<li>サブ役職「狼少年」実装</li>
</ul>

<h2 id="ver140a10">Ver. 1.4.0 α10 (Rev. 57) : 2009/07/04 (Sat) 18:52</h2>
<ul>
<li>闇鍋モード：配役ルーチンのバグ修正</li>
<li>霊界の発言で突然死タイマーがリセットされるバグ修正</li>
<li>巫女：システムメッセージ画像抜けに対応</li>
</ul>

<h2 id="ver140a9">Ver. 1.4.0 α9 (Rev. 48) : 2009/07/03 (Fri) 19:25</h2>
<ul>
<li>「不審者」実装</li>
<li>サブ役職「筆不精」「傍観者」「疫病神」実装</li>
<li>巫女：恋人後追いにも対応</li>
<li>ショック死のシステムメッセージを変更</li>
<li>子狐の霊能結果が村人になっていたバグ修正</li>
</ul>

<h2 id="ver140a8">Ver. 1.4.0 α8 (Rev. 37) : 2009/07/02 (Thu) 17:09</h2>
<ul>
<li>闇鍋モードの配役決定ルーチンを組み直し</li>
<li>魂の占い師の占い結果が正しく表示されないバグ修正</li>
<li>村作成画面のバグ修正 (キューピッドのデフォルトチェック抜け)
</ul>

<h2 id="ver140a7">Ver. 1.4.0 α7 : 2009/06/30 (Tue) 20:56</h2>
<ul>
<li>詳細不明</li>
</ul>

<h2 id="ver140a3">Ver. 1.4.0 α3-6</h2>
<ul>
<li>役職追加 (詳細不明)</li>
</ul>

<h2 id="ver140a2">Ver. 1.4.0 α2</h2>
<ul>
<li>クイズ村仮実装</li>
<li>闇鍋モード仮実装</li>
</ul>

<h2 id="ver140a1">Ver. 1.4.0 α1 : 2009/06/26 (Fri) 05:08</h2>
<ul>
<li>クイズ村実装開始</li>
<li>闇鍋モード実装開始</li>
</ul>
</body></html>
